package sec125_python_use1;

import java.util.*;

public class No2_phyton_question01 {
		/*
		 * x = input('입력 : ')
		 * a = [ 'abc123', 'def456', 'ghi789' ]
		 * a.append(x)
		 * a.remove('def456')
		 * print(a[1] [-3:], a[2] [-3], sep = ',')
		 * for i in range(3, 6) :
		 * 		print(i, end = ' ')
		 * 
		 * 결과값 - 789,xyz
		 * 		  3 4 5
		 */
	
		/* Range - 연속된 숫자 생성 / 주로 리스트, 반복문에서 사용
		 * 
		 * range(최종값) - 0 ~ 최종값-1 
		 * range(초기값, 최종값) - 초기값 ~ 최종값-1
		 * range(초기값, 최종값, 증가값) - 초기값 ~ 최종값-1, 증가값 만큼 증가 -> 숫자 생성
		 */
	
		/* Slice - 문자열, 리스트에서 일바 잘라 반환
		 * 
		 * 객체명[초기위치:최종위치] - 초기위치 ~ 최종위치-1
		 * 객체명[초기위치:최종위치:증가값] - 초기위치 ~ 최종위치-1, 증가값 만큼 증가 -> 해당 위치 요소들 가져옴
		 * 객체명[:] or 객체명[::] - 객체의 모든 요소 반환
		 * 객체명[초기위치:] - 초기위치 ~ 마지막 위치 요소들 반환
		 * 객체명[:최종위치] - 0번째 위치 ~ 최종위치-1 요소들 반환
		 * 객체명[::증가값] - 0번째 위치 ~ 마지막 위치, 증가값 만큼 증가 -> 해당위치 요소들 반환
		 */
}
